# To install, run brew bundle --global

# Taps
tap "johanhaleby/kubetail"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "mas"

# SDKs
cask "java"
cask "homebrew/cask-versions/adoptopenjdk8"
brew "python@2"

# CLI Tools
brew "bash-completion"
brew "csvkit"
brew "gnupg"
brew "pinentry-mac"
brew "sops"
brew "xz"
brew "expect"
brew "telnet"

# Building tools
brew "protobuf"
brew "cmake"
brew "coreutils"
brew "wget"
brew "libtool"
brew "go"
brew "bazel"
brew "automake"
brew "ninja"
brew "clang-format"
brew "git"
brew "hub"
brew "nvm"
brew "bower"
brew "git-lfs"
brew "maven"
brew "rbenv"

# Developer tools
brew "awscli"
brew "aws-iam-authenticator"
brew "httpie"
brew "cloc"
brew "parallel"
cask "drawio"
cask "visual-studio-code"
brew "flyway"
cask "pgadmin4"
brew "jq"
cask "insomnia"
cask "viscosity"
brew "gnuplot"
cask "bloomrpc"
tap "shopify/shopify"
brew "toxiproxy"
tap "codeclimate/formulae"
brew "codeclimate"
brew "postgresql"
brew "consul"
brew "carthage"
brew "yarn"
brew "watch"

# VMs
cask "virtualbox"
cask "minikube"
cask "docker"
brew "kubetail"

# Applications
mas "Trello", id: 1278508951
mas "Slack", id: 803453959
mas "Amphetamine", id: 937984704
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Bear", id: 1091189122
mas "Instapaper", id: 1481302432
mas "Microsoft Remote Desktop", id: 1295203466
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Xcode", id: 497799835
cask "google-chrome"
cask "omnifocus2"
cask "spotify"
cask "flycut"
cask "tripmode"
cask "adobe-acrobat-reader"
