# Base dependencies
brew "yadm"
brew "mas"
brew "gnupg"
brew "pinentry-mac"

# Useful tools
brew "csvkit"
brew "gd"
brew "jpeg"
brew "telnet"
brew "wget"
brew "exiftool"
brew "librsvg"
brew "zbar"
brew "graphviz"
brew "syncthing"
# Upgraded rsync, faster
brew "rsync"

# Development tools
brew "go"
brew "kotlin"
cask "intellij-idea-ce"
cask "visual-studio-code"
brew "bazel"
brew "carthage"
brew "cloc"
brew "httpie"
brew "jq"
brew "lua"
brew "maven"
brew "nghttp2"
brew "node"
brew "nvm"
brew "protobuf"
brew "python@3.11"
brew "rbenv"
tap "shopify/shopify"
brew "shopify/shopify/toxiproxy"
brew "watch"
brew "git"
brew "gh"
cask "1password/tap/1password-cli"
cask "docker"
brew "awscli"
brew "rustup"
brew "sdl2"
brew "zig"
brew "zls"

# Advent of Code
tap "scarvalhojr/tap"
brew "scarvalhojr/tap/aoc-cli"

# Applications
mas "Bear", id: 1091189122
mas "Omnifocus", id: 1542143627
mas "1Password for Safari", id: 1569813296
mas "In Your Face", id: 1476964367
mas "System Color Picker", id: 1545870783
mas "One Thing", id: 1604176982
cask "tripmode"
cask "spotify"
cask "vlc"
cask "flycut"
cask "MonitorControl"
cask "notion-calendar"

tap "espanso/espanso"
cask "espanso"
