# To install, run brew bundle --global

# Taps
tap "bazelbuild/tap", pin: true
tap "johanhaleby/kubetail"

# SDKs
cask "java"

# CLI Tools
brew "awscli"
brew "aws-iam-authenticator"
brew "bash-completion"

# Building tools
brew "protobuf"
brew "cmake"
brew "coreutils"
brew "wget"
brew "libtool"
brew "go"
brew "bazelbuild/tap/bazel"
brew "automake"
brew "ninja"
brew "clang-format"
brew "git"
brew "hub"
brew "nvm"
brew "bower"
brew "git-lfs"

# Developer tools
brew "cloc"
brew "parallel"
cask "drawio"
cask "visual-studio-code"
brew "flyway"
cask "pgadmin4"
brew "jq"
cask "insomnia"
cask "viscosity"
brew "gnuplot"

# VMs
cask "virtualbox"
cask "vagrant"
cask "minikube"
cask "docker"
brew "kubetail"

# Applications
mas "Trello", id: 1278508951
mas "Evernote", id: 406056744
mas "Slack", id: 803453959
mas "LimeChat", id: 414030210
mas "Amphetamine", id: 937984704
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Microsoft Remote Desktop 10", id: 1295203466
cask "google-chrome"
cask "omnifocus2"
cask "spotify"
cask "flycut"
cask "tripmode"
cask "adobe-acrobat-reader"
